IRP/src/AccumulationRegisters/R3010B_CashOnHand/R3010B_CashOnHand.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R3010B_CashOnHand</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Catalogs/CashAccounts/CashAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>CashAccounts</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CashAccountTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>BankName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>150</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Number</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>64</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>TransitAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_CommissionIsSeparate</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiptingAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>IntegrationSetting</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>CashAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>FinancialMovementType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Acquiring</name>
  <type>
   <types>CatalogRef.Hardware</types>
  </type>
 </attributes>
 <attributes>
  <name>BankCountry</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>BankIdentifierCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>9</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>BankSWIFTCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>11</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>isIBAN</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NegativeBalanceControl</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/AccumulationRegisters/R3010B_CashOnHand/ManagerModule.bsl
Function GetLockFieldNames() Export
	Return "Company, Branch, Account, Currency";
EndFunction

Function CheckBalance(Ref, CurrentRecords, ExistsRecords, Unposting, AddInfo = Undefined) Export

	Query = New Query();
	Query.TempTablesManager = New TempTablesManager();
	Query.Text = 
	"SELECT
	|	CurrentRecords.Company,
	|	CurrentRecords.Branch,
	|	CurrentRecords.Account,
	|	CurrentRecords.Currency,
	|	VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency) AS CurrencyMovementType
	|INTO CurrentRecords
	|FROM
	|	&CurrentRecords AS CurrentRecords
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ExistsRecords.Company,
	|	ExistsRecords.Branch,
	|	ExistsRecords.Account,
	|	ExistsRecords.Currency,
	|	ExistsRecords.CurrencyMovementType
	|INTO ExistsRecords
	|FROM
	|	&ExistsRecords AS ExistsRecords
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	CurrentRecords.Company,
	|	CurrentRecords.Branch,
	|	CurrentRecords.Account,
	|	CurrentRecords.Currency,
	|	CurrentRecords.CurrencyMovementType
	|INTO AllRecords
	|FROM
	|	CurrentRecords AS CurrentRecords
	|WHERE
	|	NOT &Unposting
	|UNION ALL
	|
	|SELECT
	|	ExistsRecords.Company,
	|	ExistsRecords.Branch,
	|	ExistsRecords.Account,
	|	ExistsRecords.Currency,
	|	ExistsRecords.CurrencyMovementType
	|FROM
	|	ExistsRecords AS ExistsRecords
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	AllRecords.Company,
	|	AllRecords.Branch,
	|	AllRecords.Account,
	|	AllRecords.Currency,
	|	AllRecords.CurrencyMovementType
	|INTO GroupedRecords
	|FROM
	|	AllRecords AS AllRecords
	|WHERE
	|	AllRecords.CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|	AND AllRecords.Account.NegativeBalanceControl
	|GROUP BY
	|	AllRecords.Company,
	|	AllRecords.Branch,
	|	AllRecords.Account,
	|	AllRecords.Currency,
	|	AllRecords.CurrencyMovementType
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	R3010B_CashOnHandBalance.Company,
	|	R3010B_CashOnHandBalance.Branch,
	|	R3010B_CashOnHandBalance.Account,
	|	R3010B_CashOnHandBalance.Currency,
	|	R3010B_CashOnHandBalance.CurrencyMovementType,
	|	-R3010B_CashOnHandBalance.AmountBalance AS LackOfBalance
	|FROM
	|	AccumulationRegister.R3010B_CashOnHand.Balance(, (Company, Branch, Account, Currency, CurrencyMovementType) IN
	|		(SELECT
	|			GroupedRecords.Company,
	|			GroupedRecords.Branch,
	|			GroupedRecords.Account,
	|			GroupedRecords.Currency,
	|			GroupedRecords.CurrencyMovementType
	|		FROM
	|			GroupedRecords AS GroupedRecords)) AS R3010B_CashOnHandBalance
	|		INNER JOIN GroupedRecords AS GroupedRecords
	|		ON R3010B_CashOnHandBalance.Company = GroupedRecords.Company
	|		AND R3010B_CashOnHandBalance.Branch = GroupedRecords.Branch
	|		AND R3010B_CashOnHandBalance.Account = GroupedRecords.Account
	|		AND R3010B_CashOnHandBalance.Currency = GroupedRecords.Currency
	|		AND R3010B_CashOnHandBalance.CurrencyMovementType = GroupedRecords.CurrencyMovementType
	|WHERE
	|	R3010B_CashOnHandBalance.AmountBalance < 0";
	
	Query.SetParameter("CurrentRecords", CurrentRecords);
	Query.SetParameter("ExistsRecords", ExistsRecords);
	Query.SetParameter("Unposting", Unposting);
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();

	Error = False;
	While QuerySelection.Next() Do
		Error = True;
		Message = StrTemplate(R().Error_182, QuerySelection.Account, QuerySelection.Currency, QuerySelection.LackOfBalance);
		CommonFunctionsClientServer.ShowUsersMessage(Message);
	EndDo;
	Return Not Error;
EndFunction

#Region AccessObject

// Get access key.
// See Role.TemplateAccumulationRegisters - Parameters orders has to be the same
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
// * Branch - CatalogRef.BusinessUnits -
// * Account - CatalogRef.CashAccounts -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	AccessKeyStructure.Insert("Branch", Catalogs.BusinessUnits.EmptyRef());
	AccessKeyStructure.Insert("Account", Catalogs.CashAccounts.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion

// Additional data filling.
// 
// Parameters:
//  MovementsValueTable - ValueTable
Procedure AdditionalDataFilling(MovementsValueTable) Export
	Return;	
EndProcedure
